{
  "relatedflows": [
    {
      "n.title": "Boot camp",
      "n.doc_id": "TB_BootCamp.txt",
      "n.description": "… there are many forces pushing organizations to multi-site development. Have a co-located project kickoff. This starts with development iteration planning and includes doing the first several iterations  together.",
      "n.referenceURL": "https://sites.google.com/a/scrumplop.org/published-patterns/distributed-scrum-pattern-language/boot-camp"
    },
    {
      "n.title": "Interrupts unjam blocking",
      "n.doc_id": "TD_InterruptsUnjamBlocking.txt",
      "n.description": "A comprehensive scheduling plan is difficult if not impossible, yet, without some kind of plan, it becomes easy to fall into thrashing. If a role is about to block on a critical resource, interrupt the role that provides that resource so they stop what they're doing to keep you unblocked.",
      "n.referenceURL": "http://orgpatterns.wikispaces.com/InterruptsUnjamBlocking"
    },
    {
      "n.title": "Team owns individual velocities",
      "n.doc_id": "SO_TeamOwnsIndividualVelocities.txt",
      "n.description": "When a developer takes responsibility for a task she estimates the (ideal) time to complete the task. Enough tasks are taken and estimated to equal the developer's individual velocity for the iteration. People estimate differently. Therefore, let the team own the individual velocities.",
      "n.referenceURL": "http://www.ecs.syr.edu/faculty/fawcett/handouts/CSE776/PatternPDFs/PatternsForAgileDev2.pdf"
    },
    {
      "n.title": "Development episode",
      "n.doc_id": "ID_DevelopmentEpisode.txt",
      "n.description": "It's important to build on the collective strength of an entire team and to build a true gestalt from the team members. Approach all development as a group activity as if no one had anything else to do. Expect the activity to follow the usual course of an episode where energy builds to a decision-making climax and then dissipates. At the height of the episode, purpose should be clear, terminology well understood, knowns well explored and unknowns identified. It is at exactly this point that individual strengths merge into a sort of common consciousness.",
      "n.referenceURL": "http://orgpatterns.wikispaces.com/DevelopmentEpisode"
    },
    {
      "n.title": "Sprint",
      "n.doc_id": "ID_Sprint.txt",
      "n.description": "We want to balance the need of developers to work undisturbed and the need for management and the customer to see real progress. Give the developers the space to be creative, and to learn exploring the design space, doing their actual work, undisturbed by outside interruptions, free to adapt their way of working using opportunities and insights. At the same time keep the management and stakeholders confident by showing real progress instead of documents and reports... produced as proof. Do this in short cycles, Sprints, where part of the Backlog is allocated to a small team.",
      "n.referenceURL": "http://jeffsutherland.org/scrum/scrum_plop.pdf"
    },
    {
      "n.title": "Team per task",
      "n.doc_id": "TD_TeamPerTask.txt",
      "n.description": "Crises are inevitable, and they are legion. If the project takes time to respond to each, its members will soon find themselves spending so much time responding to each crisis that the real work doesn't get done. Let a sub-team handle the diversion, which allows the main team to keep working.",
      "n.referenceURL": "http://orgpatterns.wikispaces.com/TeamPerTask"
    },
    {
      "n.title": "Feature assignment",
      "n.doc_id": "TD_FeatureAssignment.txt",
      "n.description": "For every non-trivial project, it is impossible to partition the work cleanly. Assign features to people for development. A feature development has a finite duration, and is therefore an assignment, not a role.",
      "n.referenceURL": "http://orgpatterns.wikispaces.com/FeatureAssignment"
    },
    {
      "n.title": "Fair memory",
      "n.doc_id": "TL_FairMemory.txt",
      "n.description": "A retrospective is focused on issues from the end of a development iteration. Experiences at the beginning of an iteration are forgotten. These experiences could have been used to improve the process. A log is produced during the development iteration.",
      "n.referenceURL": "https://sites.google.com/a/scrumplop.org/published-patterns/retrospective-pattern-language/fair-memory"
    },
    {
      "n.title": "Standup meeting",
      "n.doc_id": "MC_StandupMeetingA.txt",
      "n.description": "… the person receiving the information may not know the consequences that it implies for others on the team. Therefore, hold a 15 minute stand-up meeting every day.",
      "n.referenceURL": "https://pdfs.semanticscholar.org/4b2b/643707a62c11d0a2da4d5c8572ca9d94ac2a.pdf"
    },
    {
      "n.title": "Gather domain knowledge",
      "n.doc_id": "A_GatherDomainKnowledge.txt",
      "n.description": "When complexity is a key problem to projects, and the ability to deal with complexity is largely depending on individuals, what should the team members learn and do to increase their personal ability to cope with complexity? Therefore, increase your knowledge about the application domain. You will be able to apply your own judgment, and reduce the complexity associated with unknown settings and questions.",
      "n.referenceURL": "http://ceur-ws.org/Vol-566/e4_dealingwithcomplexity.pdf"
    },
    {
      "n.title": "Sprint retrospective",
      "n.doc_id": "TL_SprintRetrospective.txt",
      "n.description": "... you are reaching the end of a development iteration, and are getting ready for the next one. Naturally, no matter how well it went, you would like to improve. At the end of each iteration, before the next one, hold a meeting for self-examination of the team's behavior during the previous iteration.",
      "n.referenceURL": "https://sites.google.com/a/scrumplop.org/published-patterns/value-stream/sprint/sprint-retrospective"
    },
    {
      "n.title": "Effective handover",
      "n.doc_id": "ID_EffectiveHandover.txt",
      "n.description": "Your team is running at peak productivity, or nearing a critical delivery phase. A critical team member is departing, so you must minimise the lost productivity that will inevitably result. Therefore, the departing developer should hand over to an existing developer, setting the replacement free to do new work.",
      "n.referenceURL": "http://www.hillside.net/plop/plop98/final_submissions/P54.pdf"
    }
  ],
  "upphases": [
    {
      "phase": "Elaboration",
      "count": 4
    },
    {
      "phase": "Construction",
      "count": 4
    },
    {
      "phase": "Inception",
      "count": 1
    },
    {
      "phase": "Transition",
      "count": 3
    }
  ],
  "emotionlandscape": {
    "joy": 26,
    "anticipation": 67,
    "sadness": 31,
    "disgust": 8,
    "anger": 12,
    "fear": 39,
    "surprise": 17,
    "trust": 100
  }
}